package dn.boxman.util;

public class MapList {

	/*
	 * 0 无场景
	 * 1墙
	 * 2目标
	 * 3路
	 * 4箱子
	 * 5目标区域
	 * 6人
	 */
	//三维数组，map[]代表第N关
	static int map[][][]={
		{
			{0,0,1,1,1,0,0,0},
			{0,0,1,2,1,0,0,0},
			{0,0,1,3,1,1,1,1},
			{1,1,1,4,3,4,2,1},
			{1,2,3,4,6,1,1,1},
			{1,1,1,1,4,1,0,0},
			{0,0,0,1,2,1,0,0},
			{0,0,0,1,1,1,0,0}
		},
		{
			{1,1,1,1,1,0,0,0,0},
			{1,3,3,6,1,0,0,0,0},
			{1,3,4,4,1,0,1,1,1},
			{1,3,4,3,1,0,1,2,1},
			{1,1,1,3,1,1,1,2,1},
			{0,1,1,3,3,3,3,2,1},
			{0,1,3,3,3,1,3,3,1},
			{0,1,3,3,3,1,1,1,1},
			{0,1,1,1,1,1,0,0,0}
		},
		{
			{0,1,1,1,1,1,1,1,0,0},
			{0,1,3,3,3,3,3,1,1,1},
			{1,1,4,1,1,1,3,3,3,1},
			{1,6,3,3,4,3,3,4,3,1},
			{1,3,2,2,1,3,4,3,1,1},
			{1,1,2,2,1,3,3,3,1,0},
			{0,1,1,1,1,1,1,1,1,0},
		},
		{
			{0,1,1,1,1,0},
			{1,1,3,3,1,0},
			{1,3,6,4,1,0},
			{1,1,4,3,1,1},
			{1,1,3,4,3,1},
			{1,2,4,3,3,1},
			{1,2,2,3,2,1},
			{1,1,1,1,1,1}
		}
	};
	
	static int count=map.length;
	
	/*
	 * @Param int grade关数
	 * 根据grade关数来调取地图信息
	 */
	public static int [][]getMap(int grade){
		int temp[][];
		
		if(grade>=0 && grade<count){
			temp=map[grade];
		}
		else{
			temp=map[0];
		}
		
		int row=temp.length;
		int column=temp[0].length;
		int [][]result=new int[row][column];
		for(int i=0;i<row;i++){
			for(int j=0;j<column;j++){
				result[i][j]=temp[i][j];
			}
		}
		
		return result;
	}
	
	//获取一共有多少关地图
	public static int getCount(){
		return count;
	}
}
